
from sentence_transformers import SentenceTransformer
import time
from sklearn.metrics.pairwise import cosine_similarity
import numpy as np


model = SentenceTransformer(
    'sentence-transformers/all-MiniLM-L6-v2',
    device='cpu'
)


sentences = [
    """сам сум качен на планината во таа вечна потрага по суровината суровоста на животот и лакомоста твоја е во тоа е вината а не во виното не се наоѓа таму вистината се надевам дека  не се плашиш од висината не сакам да се чувствуваш како да опишам и да сум културен присилена  скокни, не е толку голема висината""" 
    """откопај ми ги црните дробови наполнети се со кал од шетање по ровови на црната слуга му се потребни робови а на поетот пред умирање уште неколку слогови  целиот свет го прошетав дури и посетив неколку молови"""
,"""многу сакам  да можев да си  ги исковам очите од моите капаци и да ги ставам во твојата глава за да ги гледаш работите што ги гледам за да ги мислиш работите што ти ги мислам  сакам животот да го фатам за мадињата и силно да му ги стиснам"""
,"""баш е интересна случката со влечугата баш е интересно што сеуште го слушам возот иако е одамна откачена пругата иако одмана те немам видено со сопругата зошто повеќе не се гледате да не чувате од шугата?  или го напуштивте рудникот кој што некогаш ви бил дом затоа што ја нема повеќе рудата?  знам што зделки правите знам за изнудата"""
]


start = time.time()
embeddings = model.encode(sentences)
end = time.time()

similarity = cosine_similarity(
    embeddings[0].reshape(1, -1),  
    embeddings[1].reshape(1, -1)   
)[0][0]

print("Embeddings:")
print(embeddings)
print(f"\nCosine Similarity: {similarity:.4f}")
print(f"Encoding time: {end-start:.2f} seconds")